Validação árvore de produtos - Salesforce

In [2]:
# import de libs
from google.cloud import bigquery
import pandas as pd

Lendo o BQ

In [2]:
# Construct a BigQuery client object.
client = bigquery.Client()

In [39]:
# Query em produtos de prateleira
query = """
    select "hello world" as text
    ;
"""

In [40]:
df_bq = client.query(query).to_dataframe()

In [41]:
df_bq.head()

          text
0  hello world

Lendo a planilha com a carga full de produtos

In [6]:
df_csv = pd.read_csv('teste.csv')

In [7]:
df_csv.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [8]:
df_xlsx = pd.read_excel('teste.xlsx')

In [9]:
df_xlsx.head()

    nome   setor  quantidade
0  item1  setor1           4
1  item2  setor2           2
2  item3  setor3           5

In [10]:
data_json = '{"alunos": [{"Nome": "Rita", "Info": {"Idade": 24, "Medidas": {"Peso": 62, "Altura": 1.65}}}, {"Nome": "Zeca", "Info": {"Idade": 32, "Medidas": {"Peso": 80, "Altura": 1.82}}}]}'

In [12]:
data = pd.read_json(path_or_buf=data_json, orient='columns')
pd.json_normalize(data=data.alunos, sep='_', max_level=2)

   Nome  Info_Idade  Info_Medidas_Peso  Info_Medidas_Altura
0  Rita          24                 62                 1.65
1  Zeca          32                 80                 1.82

In [13]:
data_string = "#-> Churrasqueira | Sauna | Mobiliado | Piscina <-#"

In [14]:
['Churrasqueira', 'Sauna', 'Mobiliado', 'Piscina']

['Churrasqueira', 'Sauna', 'Mobiliado', 'Piscina']

In [15]:
dados = {
    "alunos": ["Rita", "Lucas", "Zeca", "Ana"], 
    "idade": [10, 12, 11, 10], 
    "medidas_altura": [1.3, 1.5, 1.45, 1.28], 
    "medidas_peso": [42, 50, 45, 38]
}

df = pd.DataFrame(dados)

In [19]:
df.filter(like='medidas', axis='columns')

   medidas_altura  medidas_peso
0            1.30            42
1            1.50            50
2            1.45            45
3            1.28            38

In [20]:
df_A = pd.DataFrame({'A': [1, 2, 3], "B": [1, 4, 9]})
df_B = pd.DataFrame({'A': [4, 5, 6], "B": [16, 25, 36]})

In [23]:
#df_A.append(df_B, ignore_index=True)

pd.concat([df_A, df_B], ignore_index=True)

   A   B
0  1   1
1  2   4
2  3   9
3  4  16
4  5  25
5  6  36

In [24]:
df_A = pd.DataFrame({'A': [1, 2, 3], 'B': [1, 4, 9]})

In [25]:
df_B = pd.DataFrame({'B': [16, 25, 36], 'A': [4, 5, 6]})

In [27]:
nomes = pd.Series(['Data Science', 'Big Data', 'DS', 'Machine Learning', 'ML'])
nomes

0        Data Science
1            Big Data
2                  DS
3    Machine Learning
4                  ML
dtype: object

In [28]:
pd.Series(nomes.replace(['DS', 'ML'], ['Data Science', 'Machine Learning']).unique())

0        Data Science
1            Big Data
2    Machine Learning
dtype: object

In [29]:
df_1 = pd.DataFrame([2, 4, 6, 8], index=['A', 'B', 'C', 'D'], columns=['pares'])

In [30]:
df_2 = pd.DataFrame([1, 3, 5, 7], index=['C', 'D', 'E', 'F'], columns=['impares'])

In [32]:
pd.merge(
    left=df_1, 
    right=df_2,
    left_index=True,
    right_index=True,
    how='inner'
)

   pares  impares
C      6        1
D      8        3

In [35]:
pd.merge(
    left=df_1, 
    right=df_2,
    left_index=True,
    right_index=True,
    how='left'
)

   pares  impares
A      2      NaN
B      4      NaN
C      6      1.0
D      8      3.0

In [38]:
pd.merge(
    left=df_1, 
    right=df_2,
    left_index=True,
    right_index=True,
    how='outer'
)

   pares  impares
A    2.0      NaN
B    4.0      NaN
C    6.0      1.0
D    8.0      3.0
E    NaN      5.0
F    NaN      7.0

regex

In [42]:
pessoas = pd.Series([
    'Nome: Mariana Sousa | End.: Rua Damasco, 1978 Japeri-RJ 26.473-790 | Tel.: (21) 99131-8473',
    'Nome: Aline Cardoso | End.: Rua Paschoal Marmirolli, 577 Sumaré-SP 13.171-700 | Tel.: (19) 8577-4777',
    'Nome: Vitór Fernandes | Tel.: (21) 5923-5723 | End.: Rua Bernardo Franco, 1520 São Gonçalo-RJ 24.470-190',
    'Nome: Victor Sousa | Tel.: (11) 98618-2626 | End.: Rua Santa Terezinha, 27 Suzano-SP 08.694-410',
    'Nome: Vitória Dias | Tel.: (19) 97632-5829 | End.: Rua 4 JA, 500 Rio Claro-SP 13.506-010',
    'Nome: Douglas Santos | Tel.: (11) 4890-8192 | End.: Rua Alcides Teodoro Santos, 1268 São Paulo-SP 05.762-010',
    'Nome: Kauan Pinto | Tel.: (14) 6752-6858 | End.: Rua Amélia Volta Laplechade, 1334 Marília-SP 17.511-801',
    'Nome: Miguel Silva | End.: Rua Severina Ferreira, 1408 João Pessoa-PB 58.034-160 | Tel.: (83) 7077-6476',
    'Nome: Luis Castro | Tel.: (31) 97711-4493 | End.: Rua São Bento, 969 Ribeirão das Neves-MG 33.930-290',
    'Nome: Thiago Almeida | Tel.: (18) 2031-3622 | End.: Rua Liberdade, 669 Araçatuba-SP 16.015-425'
])

In [43]:
pessoas.str.extractall('(\d{2}.\d{3}-\d{3})')

                  0
  match
0 0      26.473-790
1 0      13.171-700
2 0      24.470-190
3 0      08.694-410
4 0      13.506-010
5 0      05.762-010
6 0      17.511-801
7 0      58.034-160
8 0      33.930-290
9 0      16.015-425

In [44]:
pessoas.str.extractall('(\(\d{2}\)\s\d{4,5}-\d{4})')

                       0
  match
0 0      (21) 99131-8473
1 0       (19) 8577-4777
2 0       (21) 5923-5723
3 0      (11) 98618-2626
4 0      (19) 97632-5829
5 0       (11) 4890-8192
6 0       (14) 6752-6858
7 0       (83) 7077-6476
8 0      (31) 97711-4493
9 0       (18) 2031-3622

In [45]:
anuncios = pd.Series([
    "Amplo apartamento com vista para o mar, piscina, sauna e 2 vagas de garagem. CEP 22790-735",
    "Ótima oportunidade no Leblon! Casa de condomínio com 800m² próximo a praia.",
    "Sala e quarto em Copacabana. Próximo ao metrô.",
    "Venha morar na melhor localização do Rio de Janeiro. Piscina, academia e toda estrutura de lazer.",
    "Sala comercial no Centro da cidade. 23456-021",
    "Venha conhecer o melhor de Ipanema. A duas quadras da praia. Conheça o apartamento mobiliado.",
    "Melhor localização da Barra. Condomínio com piscina, academia, espaço gourmet e muito mais.",
    "Vende-se terreno em Pedra de Guaratiba. Tratar direto com o proprietário.",
    "Apartamento de alto padrão na Lagoa. Vista pro mar e sol da manhã.",
    "Passo o ponto de loja no centro da cidade (Saara). Ligar para (21) 1234-5678 e falar com Juca."
])

In [46]:
anuncios.str.upper().str.contains('PISCINA', regex=False)

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [47]:
anuncios.str.lower().str.contains('piscina', regex=False)

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

Médoto CUT - criar classes a partir de dados numéricos

In [48]:
df = pd.DataFrame(
    {
        'alunos': ['Juca', 'Zeca', 'Ana', 'Rita', 'Lia', 'Beto'],
        'notas': [8, 6.5, 10, 7, 6, 0]
    }
).set_index('alunos')

In [49]:
df

        notas
alunos
Juca      8.0
Zeca      6.5
Ana      10.0
Rita      7.0
Lia       6.0
Beto      0.0

In [50]:
classes=[0, 6, 7, 10]
rotulos=['Reprovado', 'Recuperação', 'Aprovado']
df['resultado']=pd.cut(x=df.notas, bins=classes, labels=rotulos, include_lowest=True)
df

        notas    resultado
alunos
Juca      8.0     Aprovado
Zeca      6.5  Recuperação
Ana      10.0     Aprovado
Rita      7.0  Recuperação
Lia       6.0    Reprovado
Beto      0.0    Reprovado

In [51]:
classes=[0, 5.9, 6.9, 10]
rotulos=['Reprovado', 'Recuperação', 'Aprovado']
df['resultado']=pd.cut(x=df.notas, bins=classes, labels=rotulos)
df

        notas    resultado
alunos
Juca      8.0     Aprovado
Zeca      6.5  Recuperação
Ana      10.0     Aprovado
Rita      7.0     Aprovado
Lia       6.0  Recuperação
Beto      0.0          NaN

In [52]:
classes=[0, 5.9, 6.9, 10]
rotulos=['Reprovado', 'Recuperação', 'Aprovado']
df['resultado']=pd.cut(x=df.notas, bins=classes, labels=rotulos, include_lowest=True)
df

        notas    resultado
alunos
Juca      8.0     Aprovado
Zeca      6.5  Recuperação
Ana      10.0     Aprovado
Rita      7.0     Aprovado
Lia       6.0  Recuperação
Beto      0.0    Reprovado

Utiliando o método apply

In [53]:
anuncios = pd.DataFrame([
    "Amplo apartamento com vista para o mar, piscina, sauna e 2 vagas de garagem. CEP 22790-735",
    "Ótima oportunidade no Leblon! Casa de condomínio com 800m² próximo a praia.",
    "Sala e quarto em Copacabana. Próximo ao metrô.",
    "Venha morar na melhor localização do Rio de Janeiro. Piscina, academia e toda estrutura de lazer.",
    "Sala comercial no Centro da cidade. 23456-021",
    "Venha conhecer o melhor de Ipanema. A duas quadras da praia. Conheça o apartamento mobiliado.",
    "Melhor localização da Barra. Condomínio com piscina, academia, espaço gourmet e muito mais.",
    "Vende-se terreno em Pedra de Guaratiba. Tratar direto com o proprietário.",
    "Apartamento de alto padrão na Lagoa. Vista pro mar e sol da manhã.",
    "Passo o ponto de loja no centro da cidade (Saara). Ligar para (21) 1234-5678 e falar com Juca."
], columns=['Descricao'])

In [57]:
anuncios['Piscina'] = anuncios['Descricao'].apply(lambda x: 'piscina' in x.lower())
anuncios

                                           Descricao  Piscina
0  Amplo apartamento com vista para o mar, piscin...     True
1  Ótima oportunidade no Leblon! Casa de condomín...    False
2     Sala e quarto em Copacabana. Próximo ao metrô.    False
3  Venha morar na melhor localização do Rio de Ja...     True
4      Sala comercial no Centro da cidade. 23456-021    False
5  Venha conhecer o melhor de Ipanema. A duas qua...    False
6  Melhor localização da Barra. Condomínio com pi...     True
7  Vende-se terreno em Pedra de Guaratiba. Tratar...    False
8  Apartamento de alto padrão na Lagoa. Vista pro...    False
9  Passo o ponto de loja no centro da cidade (Saa...    False

Agregação do pandas

In [3]:
df = pd.DataFrame(
    {
        'alunos': ['Juca', 'Zeca', 'Ana', 'Rita', 'Lia', 'Beto', 'Tina', 'Lucas'],
        'notas': [8, 6.5, 10, 7, 6, 0, 5, 5.5],
        'resultado': ['AP', 'RC', 'AP', 'AP', 'RC', 'RP', 'RP', 'RP']
    }
).set_index('alunos')

In [4]:
df.agg(['mean', 'std'])
df

TypeError: Could not convert APRCAPAPRCRPRPRP to numeric

In [9]:
 df.groupby(by='resultado').agg(['mean', 'std'])

              notas
               mean       std
resultado
AP         8.333333  1.527525
RC         6.250000  0.353553
RP         3.500000  3.041381

In [6]:
df.value_counts(subset='resultado', normalize=True).to_frame(name='percentual (%)')*100
df

        notas resultado
alunos
Juca      8.0        AP
Zeca      6.5        RC
Ana      10.0        AP
Rita      7.0        AP
Lia       6.0        RC
Beto      0.0        RP
Tina      5.0        RP
Lucas     5.5        RP

In [10]:
df = pd.DataFrame.from_dict({'Zeca': [25,  176], 'Ana': [32, 152]}, columns=['Idade', 'Altura'], orient='index')

In [11]:
df.stack().unstack(0)

        Zeca  Ana
Idade     25   32
Altura   176  152

In [12]:
dados = {
    ('Moema', 'Casa'): {
        ('Padrão', 'Venda'): 35, ('Padrão', 'Locação'): 56, 
        ('Alto padrão', 'Venda'): 5, ('Alto padrão', 'Locação'): 12
    }, 
    ('Moema', 'Apartamento'): {
        ('Padrão', 'Venda'): 58, ('Padrão', 'Locação'): 42, 
        ('Alto padrão', 'Venda'): 6, ('Alto padrão', 'Locação'): 5
    }, 
    ('Jardins', 'Casa'): {
        ('Padrão', 'Venda'): 34, ('Padrão', 'Locação'): 48, 
        ('Alto padrão', 'Venda'): 28, ('Alto padrão', 'Locação'): 15
    }, 
    ('Jardins', 'Apartamento'): {
        ('Padrão', 'Venda'): 18, ('Padrão', 'Locação'): 35, 
        ('Alto padrão', 'Venda'): 32, ('Alto padrão', 'Locação'): 25
    }
}

df = pd.DataFrame(dados)

In [13]:
df.stack(level=0).unstack(level=1)

                    Apartamento          Casa
                        Locação Venda Locação Venda
Alto padrão Jardins          25    32      15    28
            Moema             5     6      12     5
Padrão      Jardins          35    18      48    34
            Moema            42    58      56    35